Repository: tahirjamil/Madrasa_app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bn

source: Verification code sent to %(target)s
ar: تم الوصول إلى الحد. حاول مرة أخرى لاحقًا.
bn: %(target)s নম্বরে ভেরিফিকেশন কোড পাঠানো হয়েছে

source: Your code is: %(code)s
ar: رمزك هو: %(code)s
bn: আপনার কোড হল: %(code)s

source: Verification Email
ar: بريد التحقق
bn: যাচাইকরণ ইমেইল

source: System is under maintenance. Please try again later.
ar: بريد التحقق
bn: যাচাইকরণ ইমেইল

source: Unknown device detected
ar: تم اكتشاف جهاز غير معروف
bn: অজানা ডিভাইস সনাক্ত হয়েছে

source: All fields including code are required
ar: جميع الحقول بما في ذلك الرمز مطلوبة
bn: সমস্ত তথ্য এবং কোড প্রয়োজন

source: Invalid phone number format
ar: تنسيق رقم الهاتف غير صالح
bn: ফোন নম্বরের ফরম্যাট সঠিক নয়

source: Registration successful
ar: تم التسجيل بنجاح
bn: নিবন্ধন সফল হয়েছে

source: User with this fullname and phone already registered
ar: المستخدم بهذا الاسم الكامل ورقم الهاتف مسجل بالفعل
bn: এই নাম এবং নম্বরের ব্যবহারকারী ইতিমধ্যে নিবন্ধিত

source: Internal server error
ar: المستخدم بهذا الاسم الكامل ورقم الهاتف مسجل بالفعل
bn: সার্ভারে ত্রুটি হয়েছে

source: All fields are required
ar: خطأ في الخادم الداخلي
bn: সমস্ত তথ্য প্রয়োজন

source: User not found
ar: جميع الحقول مطلوبة
bn: ব্যবহারকারী পাওয়া যায়নি

source: Incorrect password
ar: المستخدم غير موجود
bn: পাসওয়ার্ড ভুল

source: Account is deactivated
ar: كلمة المرور غير صحيحة
bn: অ্যাকাউন্ট নিষ্ক্রিয় করা হয়েছে

source: Additional info required
ar: تم تعطيل الحساب
bn: অতিরিক্ত তথ্য প্রয়োজন

source: Login successful
ar: مطلوب معلومات إضافية
bn: লগইন সফল হয়েছে

source: Phone number and fullname required
ar: تم تسجيل الدخول بنجاح
bn: ফোন নম্বর এবং পুরো নাম প্রয়োজন

source: Limit reached. Try again later.
ar: رقم الهاتف والاسم الكامل مطلوبان
bn: সীমা অতিক্রম হয়েছে। পরে আবার চেষ্টা করুন।

source: Failed to send verification code
ar: تم إرسال رمز التحقق إلى %(target)s
bn: ভেরিফিকেশন কোড পাঠাতে ব্যর্থ হয়েছে

source: Internal error: %(error)s
ar: فشل في إرسال رمز التحقق
bn: অভ্যন্তরীণ ত্রুটি: %(error)s

source: Phone, Fullname, and New Password are required
ar: خطأ داخلي: %(error)s
bn: ফোন, পুরো নাম এবং নতুন পাসওয়ার্ড প্রয়োজন

source: Code successfully matched
ar: رقم الهاتف والاسم الكامل وكلمة المرور الجديدة مطلوبة
bn: কোড সফলভাবে মিলেছে

source: Incorrect old password
ar: تمت مطابقة الرمز بنجاح
bn: পুরানো পাসওয়ার্ড ভুল

source: New password cannot be the same as the current password.
ar: كلمة المرور القديمة غير صحيحة
bn: নতুন পাসওয়ার্ড পূর্বের পাসওয়ার্ডের সাথে একই হতে পারে না।

source: Password Reset Successful
ar: لا يمكن أن تكون كلمة المرور الجديدة مثل الكلمة الحالية.
bn: পাসওয়ার্ড সফলভাবে রিসেট হয়েছে

source: Invalid page type
ar: تم إعادة تعيين كلمة المرور بنجاح
bn: পৃষ্ঠার ধরন সঠিক নয়

source: Invalid phone number
ar: نوع الصفحة غير صالح
bn: ফোন নম্বর সঠিক নয়

source: Invalid login details
ar: رقم الهاتف غير صالح
bn: লগইন তথ্য সঠিক নয়

source: Your account has been successfully put for deletion. It will take %(days)d days to fully delete your account. If it wasn't you, please contact us for account recovery. @An-Nur.app
ar: تفاصيل تسجيل الدخول غير صحيحة
bn: সিস্টেম রক্ষণাবেক্ষণের অধীনে। অনুগ্রহ করে পরে আবার চেষ্টা করুন।পূর্ণ নাম, ফোন এবং অ্যাকাউন্ট টাইপ প্রয়োজনআপনার অ্যাকাউন্ট ডিলিশনের জন্য সংরক্ষণ করা হয়েছে। আপনার অ্যাকাউন্ট সম্পূর্ণ মুছে ফেলার জন্য এটি %(days)d দিন সময় নিবে। যদি এটি আপনি না হন, তাহলে দয়া করে অ্যাকাউন্ট উদ্ধার করতে আমাদের সাথে যোগাযোগ করুন। @An-Nur.app

source: Account Deletion Confirmation
ar: تم إبطال الجلسة. الرجاء تسجيل الدخول مرة أخرى.
bn: অ্যাকাউন্ট মুছে ফেলার নিশ্চিতকরণ

source: Your account has been successfully deactivated. You can reactivate it within our app. If it wasn't you, please contact us immediately. @An-Nur.app
ar: لم يتم تقديم معلومات الحساب.
bn: আইডি পাওয়া যায়নিআপনার অ্যাকাউন্ট সফলভাবে নিষ্ক্রিয় করা হয়েছে। আপনি আমাদের অ্যাপে এটি পুনরায় চালু করতে পারবেন। যদি এটি আপনি না হন, দয়া করে অবিলম্বে আমাদের সাথে যোগাযোগ করুন। @An-Nur.app

source: Account Deactivation Confirmation
ar: الحساب صالح
bn: নিশ্চিতকরণ: অ্যাকাউন্ট নিষ্ক্রিয়করণ

source: Could not send confirmation. Try again later.
ar: خطأ داخلي
bn: নিশ্চিতকরণ পাঠানো যায়নি। পরে আবার চেষ্টা করুন।

source: Account deletion initiated. Check your messages.
ar: الاسم الكامل، رقم الهاتف ونوع الحساب مطلوبة
bn: অ্যাকাউন্ট মুছে ফেলার প্রক্রিয়া শুরু হয়েছে। আপনার বার্তা চেক করুন।

source: Account deactivated successfully.
ar: لم يتم العثور على المعرف
bn: অ্যাকাউন্ট সফলভাবে নিষ্ক্রিয় করা হয়েছে।

source: An error occurred
ar: يجب توفير جميع الحقول المطلوبة للطالب
bn: একটি ত্রুটি ঘটেছে

source: Account reactivated.
ar: يجب توفير جميع الحقول المطلوبة لـ %(type)s
bn: অ্যাকাউন্ট পুনরায় সক্রিয় করা হয়েছে।

source: Account reactivation failed.
ar: الاسم والهاتف والأب/الزوج مطلوبة للضيف
bn: অ্যাকাউন্ট পুনরায় সক্রিয় করা ব্যর্থ হয়েছে।

source: Session invalidated. Please log in again.
ar: تم إضافة ملف %(type)s بنجاح
bn: সেশন বাতিল হয়েছে। দয়া করে আবার লগইন করুন।

source: No account information provided.
ar: المستخدم موجود بالفعل بهذا المعرف
bn: কোনো অ্যাকাউন্ট তথ্য দেওয়া হয়নি।

source: Account is valid
ar: خطأ في قاعدة البيانات: %(error)s
bn: অ্যাকাউন্ট বৈধ

source: Internal error
ar: لم يتم العثور على المستخدم للدفع
bn: অভ্যন্তরীণ ত্রুটি

source: File not found
ar: فشلت المعاملة

source: fullname, phone and acc_type are required
ar: الهاتف والاسم الكامل ونوع الدفع مطلوبة

source: ID not found
ar: رقم الهاتف غير صالح

source: All required fields must be provided for Student
ar: تنسيق updatedSince غير صالح
bn: ছাত্রের জন্য সমস্ত প্রয়োজনীয় তথ্য দিতে হবে

source: All required fields must be provided for %(type)s
ar: خطأ داخلي في الخادم أثناء معالجة الدفع
bn: %(type)s এর জন্য সমস্ত প্রয়োজনীয় তথ্য দিতে হবে

source: Name, Phone, and Father/Spouse are required for Guest
ar: لم يتم العثور على معاملات
bn: গেস্টের জন্য নাম, ফোন এবং পিতার/স্বামীর নাম প্রয়োজন

source: %(type)s profile added successfully
ar: المبلغ ونوع الدفع مطلوبان
bn: %(type)s প্রোফাইল সফলভাবে যোগ করা হয়েছে

source: User already exists with this ID
ar: بوابة الدفع غير مُعدة بشكل صحيح
bn: এই আইডি সহ ব্যবহারকারী ইতিমধ্যে আছে

source: Database error: %(error)s
ar: بوابة الدفع غير متاحة حالياً

source: User not found for payment
ar: فشل في بدء الدفع

source: Transaction failed
ar: نوع الإرجاع غير صالح
bn: ডাটাবেস ত্রুটি: %(error)s

source: Phone, fullname and payment type required
ar: فشل الدفع

source: Invalid updatedSince format
ar: تم إلغاء الدفع

source: Internal server error during payment processing
ar: معرف المعاملة مفقود

source: No transactions found
ar: فشل التحقق من الدفع
bn: পেমেন্টের জন্য ব্যবহারকারী পাওয়া যায়নি

source: Amount and payment type are required
ar: خطأ أثناء التحقق من الدفع
bn: লেনদেন ব্যর্থ হয়েছে

source: Payment gateway is not properly configured
ar: تم تسجيل الدفع بنجاح
bn: ফোন, পুরো নাম এবং পেমেন্ট টাইপ প্রয়োজন

source: Payment gateway is currently unreachable
ar: تم اكتشاف جهاز غير معروف
bn: কোন লেনদেন পাওয়া যায়নি

source: Payment initiation failed
ar: تم إرسال رمز التحقق بنجاح

source: Invalid return type
ar: تم إرسال رمز التحقق إلى %(target)s

source: Payment failed
ar: تم إرسال رمز التحقق بنجاح
bn: পরিমাণ এবং পেমেন্ট টাইপ প্রয়োজন

source: Payment cancelled
ar: تم إرسال رمز التحقق بنجاح
bn: পেমেন্ট সফলভাবে রেকর্ড করা হয়েছে

source: Missing transaction identifier
ar: تم إرسال رمز التحقق بنجاح

source: Payment validation failed
ar: تم إرسال رمز التحقق بنجاح

source: Error during payment validation
ar: تم إرسال رمز التحقق بنجاح

source: Payment recorded successfully
ar: تم إرسال رمز التحقق بنجاح
